#Сюжет переписывался 3 раза за неделю,и прошёл к более ленивому путю (кто-бы сомневался)бна данный момент думаю что это последний сценарий,и больше задержек не будет
#За основу для взял серии игр Library of Ruina и Limbus Company от Project Moon (да все мои варианты с придумыванием своего мира провалились)

#Главного героя,которого не давно повысили до 4-го ранга на работу в маленьком,но сильном офисе, его приветствует Ден, один из работников этого оффиса,корретировщик 2-го 
#Ден поясняет новенькому что как устроенно,с небольшой насмешкой из-за ранга
#Вравается Остер - корретеровщик 1 ранга,останавливая очередную насмешку предлогает Дену показать оружейную,и дать выбор оружия для новичка
#Игроку дается выбор из 3 оружий(Ранга,Аллас или Дуррандал) и у каждого оружия будет своя уникальная способность
#После выбора Ден и Остер приводят нас к боссу этого оффиса - Венглис,корректировщик особого ранга - Белый Крик
#Звонким голосом он говорит остальным корректировщикам остаться наедине с новичком
#Венглис спрашивает нашу цель,почему мы решили прийти именно в этот офис, у игрока будет выбор,который как-то повлияет в будущем
#Венглис рассказывает свои мысли о твоих мыслях,и рассказывает про Э.Г.О. (типо суперсилы) и собирает весь офис в зале
#Босс поясняет миссию на которую мы пойдем: Синдикаты "Большого пальца" и "Указательного пальца" (мафии проще говоря) начали собираться в заброшенной лаборатории,наша цель узнать что там находится и желательно устранит их
#Босс рассказывает наш план
#Мы берем свое новое оружие и идем на миссию
#Через определённое количество времени игрок и его напарник приходят к той лаборатории где нас поджидают охраник из "Большого пальца" и начинается первая битва
#После попеды над охранником весь отряд проникает внутрь лаборатории и выполняет свою роль по плану
#Ваша роль быть как можно незаметным и тихим,и узнать что творится в этой лаборатории
#Спустя какое-то время один из членов "Указательного пальца" начинает подозревать что кто-то пробрался внутрь и замечает нас и 2 из синдиката нападают
#После победы над ними,мы маскируемся под их форму
#После этого один из синдиката нас встречает и говорит "Слушай,я тут интересные штуки нашёл,который могут пригодится в бою,но нет товарищи я их вам просто так не отдам"
#У вас появляется выбор что можно купить у тогравца(покупать не обязательно),на выбор вам дадут 4 вещи: наплечники Синдиката, Энкифалиновый модули или "Счастливая" монета или бинт
#После покупки(или отказа) торговец уходит по своим делам
#Вы проникаете внутрь лаборатории где происходят опыты над сингулярностью,как она действует и что требует,узнается что топливом является Энкифалин
#Зайдя в следующую дверь вы видите место где добывается Энкифалин,он добывается с аномалий (монстров) путем их полного уничтожения
#К вам подходит один из ученных и просит вашу ID карту (которой у вас собственоо нет) и на вас нападают более элитные охраники 1-го ранга,в тяжёлом бою ваш напарник погибает
#Вы успиваете сбежать и спрятаться,вы связываетесь с Венглисом и говорите обстановку,после чего включается сигнализация
#Вас находит побитый после предыдущей битвы охраник,и битва продолжается
#После победы над ним вы пытаетесь сбежать из лаборатории,по дороге вы видете кучу убитых членов из синдикатов и вашего оффсиа в том числе раненого Дена,который рассказывает что произошло
#Вы бежите дальше и встречаете Венглиса,сражающегося с главой "Указательного пальца" Губерта,вы решаетесь помочь Венглису
#После победы над Губертом,сзади Венглиса подходит глава "Большого пальца" Кало,и убивает Венглиса
#Вы в ярости пытаетесь ударить Кало,но все безуспешно
#Вы слышите странный,нежный женский голос который говорит вам лучше сдаться,говоря что ты не можешь изминить судьбу
        #Если мы не будем сопротивляться этому голосу - то мы исказимся и станем аномалией после чего Кало нас вырубит,и добьёт нас
#Если же мы будем сопротивляться женскому голосу - то нас поздравит странный,грубый мужской голос и одарит игрока Э.Г.О. (способности будут разными от выбора из 9 строчки)
#С помощью Э.Г.О. мы смогли одолеть Кало,члены синдеката которые выжили сбежали из лаборатории,вы спасли выживших из вашего офиса и игрок с выжившими могут обратно возвращаться в офис для реабилитции
#Конец 